content/notes/note4.md
+++
title = "Havoc Steve"
author = ["Aahaan Singh"]
date = 2025-10-23
tags = ["thoughts", "musical-stalking"]
categories = ["library"]
draft = false
+++

I have gotten around to compiling the interesting things I've read over the past couple of weeks.
Without further ado:


## Music {#music}

1.  [Siouxsie Sioux - A Teenage Obsession](https://stateofbass.wordpress.com/2013/02/11/siouxsie-sioux-a-teenage-obsession/): People laugh at teenage girls for being obsessed with certain artists but it used to be a more common thing, and a more physical thing.
    This guy had some really interesting experiences with the Banshees in their early days until he fell out of love with them (also, arguably, in their early days).
    Getting an autograph from Siouxsie Sioux with an Iggy Pop lyric referencing a previous interaction you had with her sounds really cool.
    On a related note, Iggy's "Sixteen" (from where said lyric comes) is incredible, possibly the closest he got solo to the Stooges' stuff; I'm not sure I vibe with the lyrics, though.
2.  [The Bland Ballad of Jesse Wells](https://stevenhyden.substack.com/p/the-bland-ballad-of-jesse-welles): I will admit that I had not heard of this guy before reading Steven Hyden's piece on him, but it is a good piece that considers the meaning of "protest music".
    Jesse Wells seems like the prime example of someone who dons the aesthetic of protest music without really sticking his neck out, so he's keeping his cake and eating it too.
    Also, "he's an Arkansas Muppet rather than a New York Doll" is an all-timer.
3.  [Compilation Nation: Mutant Disco](https://compilationnation.substack.com/p/compilation-nation-mutant-disco): Sydney Salk does some digging into a ZE Records comp, which, if you know anything about ZE Records, is necessarily interesting.
    Mutant Disco is more winking performance than music, I think, but there are some great songs to come from the label—my faves are Was (Not Was)'s "Tell Me That I'm Dreaming,"
    the disco version of James White's "Contort Yourself," and Cristina's "Deb Behind Bars" (the alternate version; I have no clue what they were thinking with the original).
    Here's a curiosity: there's a comp called ZE Records Story 1979/2009 that's entirely late '70s and early '80s stuff except for one song from a band called [Michael Dracula](https://drownedinsound.com/in_depth/2820102-discover--michael-dracula).
    As far as I can tell, ZE Records went defunct in 1984, revived in 2003, released Michael Dracula's
    {{< sidenote "single album" >}}It's pretty good—haunting in some places, angry in others, and interesting throughout. Just wish I had the lyrics somewhere.{{< /sidenote >}}
    in 2008 to [a smidge of interest](https://www.thelineofbestfit.com/reviews/albums/michael-dracula-in-the-red-2429), and went defunct again some time later without releasing another new artist.
    The band's singer now runs a record studio.


## Art {#art}

1.  [Pet Portraits for InkTober](https://tina-koyama.blogspot.com/2025/10/pet-portraits-for-inktober.html): Tina Koyama has a great blog on urban sketching in Seattle.
    I love the pet portraits that she's done here—the eyes are so expressive and it feels like you're getting some of the character of the pets in addition to their likenesses.
    In other words, the dogs are goofballs and the cat is a stoic creature.
2.  [The Savage Sword of Susan](https://badmachinery.com/comic/outrageous-good-fortune-savage-sword-of-susan-concludes/): I was sad that John Allison's miniseries ended.
    It felt a bit rushed, to be honest, but it was lots of fun.


## Other {#other}

1.  [Thank You For Being Annoying](https://www.experimental-history.com/p/thank-you-for-being-annoying): The conception of things that drive people as the things in their control that annoy them is an interesting one.
    I definitely feel that way when I have something that I really want to do, because it distracts me from doing anything else.
    I don't know if "good annoyance" is the only thing that drives people to do exceptional things but the argument for it being an important factor is a convincing one.
2.  [Family Affair](https://www.thesecondserve.com/rinderknech-and-vacherot-family-affair/): I don't follow tennis as much as I did before Nadal retired (and even then, I was mostly just following Nadal).
    That is unfortunate because I missed the unfolding of this incredible story of low-ranked cousins making the finals of the _same masters tournament_.
    What are the chances?

Evidently, an interesting few months.
Here's the
{{< backlink "note1" "previous" >}}
library post for a refresher on what happened before then!
